:PROPERTIES:
:ID:       6D5E9808-B9DE-4B7E-BFFB-60D116B87106
:END:
#+title: tidalcyclesの音階(scale)
#+filetags: :tidalcycles:

tidalcycleで[[id:5BB91630-A572-4A92-BC7F-432BE4E5525B][音階(scale)]]を表現したい

https://tidalcycles.org/docs/reference/harmony_melody/#scales

#+tblname: table
| do | re | mi | fa | so | ra | si |
|----+----+----+----+----+----+----|
|  0 |  2 |  4 |  5 |  7 |  9 | 11 |
| 12 | 14 | 16 | 17 | 19 | 21 | 23 |

#+begin_src python :results output :var tbl=table
print(tbl)
#+end_src

#+RESULTS:
: [[0, 2, 4, 5, 7, 9, 11], [12, 14, 16, 17, 19, 23, 23]]
